[
    {
        "id": "Magnus Carlsen",
        "description": "Magnus Carlsen is a Norwegian chess grandmaster and one of the greatest players in history. He became a grandmaster at 13, quickly challenging the world's best with his sharp intuition. His deep understanding of chess and consistent top-level performance have made him a dominant force since 2010, setting numerous records in the process.\n\nCarlsen's playstyle is marked by versatility and adaptability, thriving in any position. He excels in all phases of the game—openings, middlegames, and endgames—and is known for squeezing wins from seemingly drawn positions with exceptional precision. His legendary endgame skills, combined with an uncanny ability to maintain focus under pressure, make him incredibly difficult to beat, often outlasting opponents in long, grueling battles.",
        "peakRating": 2882,
        "title": "Grandmaster (GM)",
        "nationality": "Norwegian 🇳🇴",
        "gender": "Male ♂️",
        "birth": "30th November, 1990",
        "major1": "World Champion (2013-2023)",
        "major2": "Triple Crown Winner",
        "major3": "Highest ever FIDE rating",
        "match1": 0,
        "match2": 1,
        "match3": 2,
        "photoRoute": "Resources/carlsen/"
    },
    {
        "id": "Garry Kasparov",
        "description": "Garry Kasparov is a Russian chess grandmaster and former World Chess Champion, often regarded as one of the greatest players in history. He became the youngest World Champion at 22 and held the title from 1985 to 2000. Known for his aggressive, dynamic style and deep opening preparation, Kasparov dominated the chess world for two decades.\n\nKasparov's playstyle is marked by his sharp tactical prowess and willingness to take risks. He excelled in creating complex, unbalanced positions where he could outmaneuver his opponents. His deep understanding of both strategy and tactics allowed him to consistently outplay the best, setting new standards in competitive chess.",
        "peakRating": 2851,
        "title": "Grandmaster (GM)",
        "nationality": "Russian 🇷🇺",
        "gender": "Male ♂️",
        "birth": "13th April, 1963",
        "major1": "World Champion (1985-2000)",
        "major2": "Youngest World Champion",
        "major3": "Peak FIDE rating of 2851",
        "match1": 3,
        "match2": 4,
        "match3": 5,
        "photoRoute": "Resources/kasparov/"
    },
    {
        "id": "Bobby Fischer",
        "description": "Bobby Fischer was an American chess grandmaster and former World Chess Champion, known for his unmatched genius and controversial life. He became the first American-born World Champion in 1972, defeating Boris Spassky during the Cold War, making chess a global sensation. Fischer's strategic depth and profound endgame skills were revolutionary.\n\nFischer's playstyle was defined by his relentless pursuit of perfection and deep understanding of the game. His precision in calculating variations and his ability to outplay opponents in every phase of the game made him a formidable player. Fischer's influence on modern chess theory, particularly in openings, remains significant to this day.",
        "peakRating": 2785,
        "title": "Grandmaster (GM)",
        "nationality": "American 🇺🇸",
        "gender": "Male ♂️",
        "birth": "9th March, 1943",
        "major1": "World Champion (1972-1975)",
        "major2": "20 consecutive wins",
        "major3": "Perfect 1970 Interzonal",
        "match1": 6,
        "match2": 7,
        "match3": 8,
        "photoRoute": "Resources/fischer/"
    },
    {
        "id": "José Raúl Capablanca",
        "description": "José Raúl Capablanca was a Cuban chess grandmaster and World Chess Champion from 1921 to 1927, renowned for his exceptional endgame skills and natural talent. Often referred to as the 'chess machine,' Capablanca was known for his seemingly effortless play and ability to simplify complex positions into winning endgames.\n\nCapablanca's playstyle was characterized by clarity and precision, focusing on positional understanding and avoiding unnecessary complications. His ability to outmaneuver opponents in simplified positions made him one of the most admired players in history. His influence on endgame theory and positional play has left a lasting legacy in the chess world.",
        "peakRating": 2725,
        "title": "Grandmaster (GM)",
        "nationality": "Cuban 🇨🇺",
        "gender": "Male ♂️",
        "birth": "19th November, 1888",
        "major1": "World Champion (1921-1927)",
        "major2": "63-game unbeaten streak",
        "major3": "Won 1916 St. Petersburg",
        "match1": 9,
        "match2": 10,
        "match3": 11,
        "photoRoute": "Resources/capablanca/"
    },
    {
        "id": "Judit Polgár",
        "description": "Judit Polgár is a Hungarian chess grandmaster, widely considered the strongest female player in history. She broke barriers by competing against and defeating top male players, reaching a peak rating of 2735. Known for her aggressive and tactical style, Polgár consistently played at the highest level, revolutionizing how women were perceived in chess.\n\nPolgár's playstyle was marked by boldness and creativity, often taking risks and creating complex, sharp positions. Her tactical brilliance and fearless approach allowed her to outplay many of the world’s best players, making her a trailblazer and an inspiration for future generations of chess players.",
        "peakRating": 2735,
        "title": "Grandmaster (GM)",
        "nationality": "Hungarian 🇭🇺",
        "gender": "Female ♀️",
        "birth": "23rd July, 1976",
        "major1": "First woman in top 10",
        "major2": "Defeated 11 World Champs",
        "major3": "Youngest GM at age 15",
        "match1": 12,
        "match2": 13,
        "match3": 14,
        "photoRoute": "Resources/polgar/"
    }
]